const { handleChat } = require('../services/chats-api')
const { handleStore } = require('../services/stores-api')
const handleError = require('./handle-error')

module.exports = async function handleFAQCommand(ctx) {
	try {
		await handleChat(ctx)
		await handleStore(ctx.chat.id)

		const reply = `
<b>Як користуватися ботом?</b>
1. Натискаєте команду /start 2. Обираєте варіант розподілу. 3. Обираєте кількість команд. 4. Відправляєте список гравців. 5. Якщо обрано варіант розподілу "Капітанами", то обираєте капітанів, а потім кожен по черзі набирає собі гравців у команду. Якщо обрано інщий варіант розподілу, то бот самостійно поділить гравців на команди.

<b>Як працює рандом (випадковий вибір)?</b>
Бот написаний на мові програмування JavaScript, в якій є вбудований функціонал генерації випадкового числа у заданому діапазоні. Завдяки цьому функціоналу реалізовано рандомний вибір гравця зі списку гравців. Бот не запам'ятовує та не використовує минулі розподіли, послідовність чи будь-що інше, що може вплинути на поточний рандомний вибір. Іноді може здаватися, що бот наче бере до уваги минулі розподіли, але це лише так здеється через малу вирібку. Рандом використовується при варіантах розподілу "За скілом", "Рандомно", випадковому обранні капітанів та при обранні послідовності набору гравців у варіанті розподілу "Капітанами".
`

		await ctx.replyWithHTML(reply)
	} catch (err) {
		await handleError({ ctx, err })
	}
}
