const replies = {
  startCommandReply: `
Я бот, що був створений для розподілу гравців на команди у командних видах спорту. Для початку оберіть варіант розподілу:

<b>За скілом</b> - гравці будуть поділені на команди, враховуючи індивідуальні навички кожного гравця. Для цього пізніше потрібно буде відправити список гравців, сформований від найкращого до найгіршого гравця (на вашу суб'єктивну думку).

<b>Рандомно</b> - гравці будуть поділені на команди випадковим чином, не зважаючи на індивідуальні навички кожного гравця.

<b>Капітанами</b> - кожен з капітанів буде по черзі набирати собі гравців у команду. Для цього пізніше я випадковим чином оберу капітанів, або потрібно буде відправити список капітанів.
`,
  chooseTeamsQuantityReply: 'Оберіть кількість команд',
  firstChooseSplitVariantReply: 'Спочатку оберіть варіант розподілу',
  fitstChooseTeamsQuantityReply: 'Спочатку оберіть кількість команд',
  
  youChoseSkillSplitReply: `<i>❗Ви обрали розподіл "За скілом", тому обов'язково потрібно відправити список гравців, сформований від найкращого до найгіршого гравця (на вашу суб'єктивну думку)</i>`,
  dontTouchPlayerButtons: `<i>❗Інші користувачі чату не натискайте на кнопки гравців, тому що бот сприйме це як вибір капітана</i>`,
};

module.exports = replies;
